In [1]:
#import dependencies
import pandas as pd

In [2]:
csv_path = "static/data/Tesla_car_sales.csv"
tesla_sale_df = pd.read_csv(csv_path)
tesla_sale_df

   Year     Q1     Q2     Q3      Q4
0  2015      0      0      0   17400
1  2016  14820  14370  24500   22200
2  2017  25000  22000  26150   29870
3  2018  29980  40740  83500   90700
4  2019  63000  95200  97000  112000

In [3]:
tesla_column = list(tesla_sale_df)
print(tesla_column)

['Year', 'Q1', 'Q2', 'Q3', 'Q4']

In [4]:
tesla_column.remove('Year')
print(tesla_column)

['Q1', 'Q2', 'Q3', 'Q4']

In [5]:
tesla_sale_df["Yearly Total"] = tesla_sale_df[tesla_column].sum(axis=1)
tesla_sale_df

   Year     Q1     Q2     Q3      Q4  Yearly Total
0  2015      0      0      0   17400         17400
1  2016  14820  14370  24500   22200         75890
2  2017  25000  22000  26150   29870        103020
3  2018  29980  40740  83500   90700        244920
4  2019  63000  95200  97000  112000        367200